Set up Configuration

In [ ]:
%load_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://cooltime0608:Cooltime0608!1@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: cooltime0608@dev'

# **스키마 변경**

다양한 SELECT 실행해보기

In [ ]:
%%sql

SELECT *
FROM raw_data.user_session_channel
LIMIT 10;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1491, '00029153d12ae1c9abe59c17ff2e0895', 'Organic'),
 (59, '0002ac0d783338cfeab0b2bdbd872cda', 'Naver'),
 (117, '0006246bee639c7a7b11a08e34dd3cc6', 'Youtube'),
 (572, '0006dd05ea1e999ddaa041a7091b7b36', 'Organic'),
 (935, '0007cda84fafdcf42f96c4f4adb7f8ce', 'Google'),
 (1363, '000a91f3e374e6147d58ed1814247508', 'Naver'),
 (780, '000c076c390a4c357313fca29e390ece', 'Naver'),
 (1917, '000d0c74074191add6f22e0004db8f76', 'Organic'),
 (1357, '000d54aadcedee0739d39127955f2cdb', 'Instagram'),
 (1247, '000dd3543ac84d906eae52e7c779bb2a', 'Naver')]

In [ ]:
%%sql

SELECT DISTINCT channel                      -- 유일한 채널 이름을 알고 싶은 경우
FROM raw_data.user_session_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Organic',),
 ('Google',),
 ('Facebook',),
 ('Instagram',),
 ('Naver',),
 ('Youtube',)]

In [ ]:
%%sql

SELECT COUNT(1)                    -- 테이블의 모든 레코드 수 카운트. COUNT(*). 하나의 레코드
FROM raw_data.user_session_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

### 비어 있는 테이블 만들고 레코드 추가하고 COUNT하기

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.test_table;
CREATE TABLE cooltime0608.test_table (
    value int
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO cooltime0608.test_table VALUES (NULL), (1), (1), (0), (0), (4), (3);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM cooltime0608.test_table;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None,), (1,), (1,), (0,), (0,), (4,), (3,)]

아래 COUNT 문들의 결과값은 얼마일까?

In [ ]:
%%sql

SELECT COUNT(1), COUNT(value), COUNT(DISTINCT value)
FROM cooltime0608.test_table;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(7, 6, 4)]

### Primary Key 이해해보기와 Data Quality 검사해보기

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.test_channel;
CREATE TABLE cooltime0608.test_channel (
   channel varchar(32) primary key,
   description varchar(64) default 'test'
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO cooltime0608.test_channel VALUES ('FACEBOOK', 'test'), ('GOOGLE', 'test');

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM cooltime0608.test_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

In [ ]:
%%sql

INSERT INTO cooltime0608.test_channel VALUES ('FACEBOOK'), ('GOOGLE');

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM cooltime0608.test_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[('FACEBOOK', 'test'),
 ('GOOGLE', 'test'),
 ('FACEBOOK', 'test'),
 ('GOOGLE', 'test')]

In [ ]:
%%sql

SELECT DISTINCT * FROM cooltime0608.test_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 'test'), ('GOOGLE', 'test')]

필드 이름 변경해보기

In [ ]:
%%sql

ALTER TABLE cooltime0608.test_channel RENAME channel to channelname;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

중복 레코드 확인해보기

In [ ]:
%%sql

SELECT COUNT(1) FROM cooltime0608.test_channel;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(4,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM (
    SELECT DISTINCT * FROM cooltime0608.test_channel
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

primary key uniqueness 확인해보기

In [ ]:
%%sql

SELECT channelname, count(1)
FROM cooltime0608.test_channel
GROUP BY 1
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('FACEBOOK', 2), ('GOOGLE', 2)]

타임 스탬프 필드가 있다면 최근에도 업데이트된 레코드가 있는지 꼭 확인. 언제부터 레코드가 생성되었는지도 확인. 월별로 레코드수를 확인해보는 것도 좋은 버릇

In [ ]:
%%sql

SELECT MAX(ts), MIN(ts)
FROM raw_data.session_timestamp;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(datetime.datetime(2019, 11, 30, 23, 58, 23), datetime.datetime(2019, 5, 1, 0, 13, 11, 783000))]

### CASE WHEN을 사용해보기

In [ ]:
%%sql

SELECT LEFT(ts, 7), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 18059),
 ('2019-08', 17151),
 ('2019-10', 18899),
 ('2019-07', 14840),
 ('2019-09', 15790),
 ('2019-05', 6261),
 ('2019-06', 10520)]

월별로 10000 혹은 그 이상 세션이면 ">= 10,000" 아니면 "< 10,000" 이렇게 찍어보기

In [ ]:
%%sql

SELECT LEFT(ts, 7), CASE WHEN COUNT(1) >= 10000 THEN '>= 10,000' ELSE '< 10,000' END
FROM raw_data.session_timestamp
GROUP BY 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-10', '>= 10,000'),
 ('2019-07', '>= 10,000'),
 ('2019-09', '>= 10,000'),
 ('2019-05', '< 10,000'),
 ('2019-06', '>= 10,000'),
 ('2019-11', '>= 10,000'),
 ('2019-08', '>= 10,000')]

월별로 15000 혹은 그 이상 세션이면 ">= 15,000", 10000보다 작으면 "< 10,000", 그 사이이면 "10000 and 15000" 이렇게 찍어보기

In [ ]:
%%sql

SELECT
    LEFT(ts, 7),
    CASE 
        WHEN COUNT(1) >= 15000 THEN '>= 15,000'
        WHEN COUNT(1) < 10000 THEN '< 10,000'
        ELSE '10000 and 15000'
    END
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-05', '< 10,000'),
 ('2019-06', '10000 and 15000'),
 ('2019-07', '10000 and 15000'),
 ('2019-08', '>= 15,000'),
 ('2019-09', '>= 15,000'),
 ('2019-10', '>= 15,000'),
 ('2019-11', '>= 15,000')]

### 공백이 들어있는 필드이름 혹은 예약된 키워드를 필드이름으로 사용하려면?

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.test;
CREATE TABLE cooltime0608.test (
    group int primary key,
    'mailing address' varchar(32)
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
(psycopg2.ProgrammingError) syntax error at or near "group"
LINE 2:     group int primary key,
            ^

[SQL: CREATE TABLE cooltime0608.test (
    group int primary key,
    'mailing address' varchar(32)
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
%%sql

CREATE TABLE cooltime0608.test (
    "group" int primary key,
    "mailing address" varchar(32)
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

SELECT "group"
FROM cooltime0608.test;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
0 rows affected.

[]

### 다양한 WHERE clause 사용해보기

WHERE에서 "in"을 사용한 clause 사용해보기

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel in ('Google','Facebook');  -- not in

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like '%oo%';   -- not like

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(33773,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel
WHERE channel like 'F%';

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(16791,)]

In [ ]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp
WHERE ts BETWEEN '2019-05-01' and '2019-06-01';

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(6261,)]

### NULL과 TRUE/FALSE 이해하기

In [ ]:
%%sql

SELECT COUNT(1)
FROM cooltime0608.test_table
WHERE value is NULL; -- primary key로 지정된 필드에 꼭 해보는 것이 좋음. WHERE value != NULL이 아님. IS NULL의 반대는 IS NOT NULL

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

기본적으로 필드는 NULL 값을 가질 수 있음. 만일 어느 필드의 값이 NULL이 될 수 없다면 CREATE TABLE 실행시 지정가능

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.test_null;
CREATE TABLE cooltime0608.test_null (
    value int NOT NULL
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO cooltime0608.test_null VALUES (NULL);

Boolean 필터링과 NULL과의 관계

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.test_boolean;
CREATE TABLE cooltime0608.test_boolean (
    value boolean 
)

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.

[]

In [ ]:
%%sql

INSERT INTO cooltime0608.test_boolean VALUES (True), (False), (True), (True), (True), (NULL);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM cooltime0608.test_boolean;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[(True,), (False,), (True,), (True,), (True,), (None,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM cooltime0608.test_boolean WHERE value = False;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1,)]

In [ ]:
%%sql

SELECT COUNT(1) FROM cooltime0608.test_boolean WHERE value is not True;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(2,)]

NULL이 들어간 경우의 연산은?

In [ ]:
%%sql

SELECT COUNT(NULL);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(0,)]

In [ ]:
%%sql

SELECT 1/NULL;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

In [ ]:
%%sql

SELECT 0+NULL;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(None,)]

### COALESCE, NULLIF

In [ ]:
%%sql

SELECT 100/value
FROM cooltime0608.test_table;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.extensions.QueryCanceledError) Divide by zero

[SQL: SELECT 100/value
FROM cooltime0608.test_table;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%%sql

SELECT value, 100/NULLIF(value, 0)
FROM cooltime0608.test_table;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None, None), (1, 100), (1, 100), (0, None), (0, None), (4, 25), (3, 33)]

In [ ]:
%%sql

SELECT value, COALESCE(value, 1) -- NULL인 경우 1을 대신 사용하고 싶다면
FROM cooltime0608.test_table;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(None, 1), (1, 1), (1, 1), (0, 0), (0, 0), (4, 4), (3, 3)]

세션이 가장 많이 생성된 시간대는?

In [ ]:
%%sql

SELECT EXTRACT(HOUR FROM ts), COUNT(1) as session_count
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(15, 15339)]

가장 많이 사용된 채널은 무엇인가?

In [ ]:
%%sql

SELECT
    channel,
    COUNT(1) AS session_count,
    COUNT(DISTINCT userId) AS user_count
FROM raw_data.user_session_channel
GROUP BY 1                         -- GROUP BY channel
ORDER BY 2 DESC;              -- ORDER BY session_count DESC

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Youtube', 17091, 889),
 ('Google', 16982, 893),
 ('Naver', 16921, 882),
 ('Organic', 16904, 895),
 ('Instagram', 16831, 895),
 ('Facebook', 16791, 889)]

가장 많은 세션을 만들어낸 사용자 ID는 무엇인가?

In [ ]:
%%sql

SELECT
    userId,
    COUNT(1) AS count
FROM raw_data.user_session_channel
GROUP BY 1                         -- GROUP BY userId
ORDER BY 2 DESC              -- ORDER BY count DESC
LIMIT 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(1615, 528)]

월별 채널별 유니크한 사용자 수

In [ ]:
%%sql

SELECT 
  TO_CHAR(A.ts, 'YYYY-MM') AS month,
  channel,
  COUNT(DISTINCT B.userid) AS mau
FROM raw_data.session_timestamp A
JOIN raw_data.user_session_channel B ON A.sessionid = B.sessionid
GROUP BY 1, 2      
ORDER BY 1 DESC, 2;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
42 rows affected.

[('2019-11', 'Facebook', 688),
 ('2019-11', 'Google', 688),
 ('2019-11', 'Instagram', 669),
 ('2019-11', 'Naver', 667),
 ('2019-11', 'Organic', 677),
 ('2019-11', 'Youtube', 677),
 ('2019-10', 'Facebook', 698),
 ('2019-10', 'Google', 699),
 ('2019-10', 'Instagram', 707),
 ('2019-10', 'Naver', 713),
 ('2019-10', 'Organic', 709),
 ('2019-10', 'Youtube', 705),
 ('2019-09', 'Facebook', 597),
 ('2019-09', 'Google', 599),
 ('2019-09', 'Instagram', 588),
 ('2019-09', 'Naver', 592),
 ('2019-09', 'Organic', 592),
 ('2019-09', 'Youtube', 588),
 ('2019-08', 'Facebook', 611),
 ('2019-08', 'Google', 610),
 ('2019-08', 'Instagram', 621),
 ('2019-08', 'Naver', 626),
 ('2019-08', 'Organic', 608),
 ('2019-08', 'Youtube', 614),
 ('2019-07', 'Facebook', 558),
 ('2019-07', 'Google', 556),
 ('2019-07', 'Instagram', 567),
 ('2019-07', 'Naver', 553),
 ('2019-07', 'Organic', 557),
 ('2019-07', 'Youtube', 564),
 ('2019-06', 'Facebook', 414),
 ('2019-06', 'Google', 412),
 ('2019-06', 'Instagram', 410),
 ('2019-06', 'Naver', 398),
 ('2019-06', 'Organic', 416),
 ('2019-06', 'Youtube', 400),
 ('2019-05', 'Facebook', 247),
 ('2019-05', 'Google', 253),
 ('2019-05', 'Instagram', 234),
 ('2019-05', 'Naver', 237),
 ('2019-05', 'Organic', 238),
 ('2019-05', 'Youtube', 244)]

### 요약 테이블을 CTAS (Create Table 이름 As SELECT)로 생성해보기

In [ ]:
%%sql

CREATE TABLE cooltime0608.monthly_active_user_summary AS 
SELECT TO_CHAR(ts, 'YYYY-MM') AS month, COUNT(DISTINCT userid)
FROM raw_data.user_session_channel A
JOIN raw_data.session_timestamp B ON A.sessionid = B.sessionid
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

SELECT * FROM cooltime0608.monthly_active_user_summary;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 721),
 ('2019-08', 662),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

In [ ]:
%%sql

DROP TABLE cooltime0608.monthly_active_user_summary;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]

In [ ]:
%%sql

SELECT EXTRACT(HOUR FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(15, 15339)]

In [ ]:
%%sql

SELECT EXTRACT(DOW FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(5, 15091)]

In [ ]:
%%sql

SELECT EXTRACT(DOW FROM ts), EXTRACT(HOUR FROM ts), COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1, 2
ORDER BY 3 DESC
LIMIT 1;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(5, 15, 2290)]

In [ ]:
%%sql

SELECT ts, channel
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
WHERE userid = 251
ORDER BY 1;

### UNION과 UNION ALL 차이점 이해하기

In [ ]:
%%sql

SELECT 'keeyong' as first_name, 'han' as last_name

UNION

SELECT 'elon', 'musk'

UNION

SELECT 'keeyong', 'han'

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
2 rows affected.

[('elon', 'musk'), ('keeyong', 'han')]

In [ ]:
%%sql

SELECT 'keeyong' as first_name, 'han' as last_name

UNION ALL

SELECT 'elon', 'musk'

UNION ALL

SELECT 'keeyong', 'han'

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
3 rows affected.

[('keeyong', 'han'), ('elon', 'musk'), ('keeyong', 'han')]

## JOIN:

An SQL JOIN clause is used to combine rows from two or more tables, based on a common field between them.

왼쪽 테이블을 LEFT라고 하고 오른쪽 테이블을 RIGHT이라고 하자. JOIN의 결과는 방식에 상관없이 양쪽의 필드를 모두 가진 새로운 테이블을 만들어내게 됨. 조인의 방식에 따라 다음 두 가지가 달라짐:

1. 어떤 레코드들이 선택되는지?
2. 어떤 필드들이 채워지는지?

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.vital;
CREATE TABLE cooltime0608.vital (
    UserID int,
    VitalID	int,
    Date date,
    Weight int
);
INSERT INTO cooltime0608.vital VALUES
(100,	1, '2020-01-01', 75),
(100, 3, '2020-01-02', 78),
(101, 2, '2020-01-01', 90),
(101, 4, '2020-01-02', 95);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.
4 rows affected.

[]

In [ ]:
%%sql

DROP TABLE IF EXISTS cooltime0608.alert;
CREATE TABLE cooltime0608.alert (
    AlertID int,
    VitalID	int,
    AlertType varchar(32),
    Date date,
    UserID int
);
INSERT INTO cooltime0608.alert VALUES
 (1,	4, 'WeightIncrease', '2020-01-01', 101),
 (2, NULL, 'MissingVital', '2020-01-04', 100),
 (3, NULL, 'MissingVital', '2020-01-04', 101);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.
Done.
3 rows affected.

[]

* INNER JOIN
1. 양쪽 테이블에서 매치가 되는 레코드들만 리턴함
2. 양쪽 테이블의 필드가 모두 채워진 상태로 리턴됨

In [ ]:
%%sql

SELECT * FROM cooltime0608.Vital v
JOIN cooltime0608.Alert a ON v.vitalID = a.vitalID;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101, 4, datetime.date(2020, 1, 2), 95, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101)]

* LEFT JOIN: 
1. 왼쪽 테이블의 레코드는 모두 리턴되며 오른쪽 테이블과 매칭이 되는 레코드들의 경우에는 오른쪽 테이블 레코드들의 컬럼들이 채워진 상태로 리턴됨.
2. 매칭이 안되는 왼쪽 테이블 레코드들은 오른쪽 테이블에서 들어오는 필드들은 NULL로 채워짐

In [ ]:
%%sql

SELECT * FROM cooltime0608.Vital v
LEFT JOIN cooltime0608.Alert a ON v.vitalID = a.vitalID;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[(100, 1, datetime.date(2020, 1, 1), 75, None, None, None, None, None),
 (100, 3, datetime.date(2020, 1, 2), 78, None, None, None, None, None),
 (101, 2, datetime.date(2020, 1, 1), 90, None, None, None, None, None),
 (101, 4, datetime.date(2020, 1, 2), 95, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101)]

* FULL JOIN (OUTER JOIN):
1. 왼쪽 테이블과 오른쪽 테이블의 모든 레코드들을 리턴함
2. 매칭되는 경우에만 양쪽 테이블들의 모든 필드들이 채워진 상태로 리턴됨

In [ ]:
%%sql

SELECT * FROM cooltime0608.Vital v
FULL JOIN cooltime0608.Alert a ON v.vitalID = a.vitalID;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[(101, 4, datetime.date(2020, 1, 2), 95, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101),
 (None, None, None, None, 2, None, 'MissingVital', datetime.date(2020, 1, 4), 100),
 (None, None, None, None, 3, None, 'MissingVital', datetime.date(2020, 1, 4), 101),
 (101, 2, datetime.date(2020, 1, 1), 90, None, None, None, None, None),
 (100, 1, datetime.date(2020, 1, 1), 75, None, None, None, None, None),
 (100, 3, datetime.date(2020, 1, 2), 78, None, None, None, None, None)]

* CARTESIAN JOIN (CROSS JOIN): 
1. 조인 조건 없이 두 개 테이블의 내용을 모두 조합한 결과 레코드들을 생성

In [ ]:
%%sql

SELECT *
FROM (
    SELECT vitalid  -- 1,2,3,4
    FROM cooltime0608.vital
)
CROSS JOIN (
    SELECT alertid   -- 1,2,3
    FROM cooltime0608.alert
);

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
12 rows affected.

[(1, 1),
 (1, 2),
 (1, 3),
 (3, 1),
 (3, 2),
 (3, 3),
 (2, 1),
 (2, 2),
 (2, 3),
 (4, 1),
 (4, 2),
 (4, 3)]

In [ ]:
%%sql

SELECT * FROM cooltime0608.Vital v
CROSS JOIN cooltime0608.Alert a;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
12 rows affected.

[(100, 1, datetime.date(2020, 1, 1), 75, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101),
 (100, 3, datetime.date(2020, 1, 2), 78, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101),
 (101, 2, datetime.date(2020, 1, 1), 90, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101),
 (101, 4, datetime.date(2020, 1, 2), 95, 1, 4, 'WeightIncrease', datetime.date(2020, 1, 1), 101),
 (100, 1, datetime.date(2020, 1, 1), 75, 2, None, 'MissingVital', datetime.date(2020, 1, 4), 100),
 (100, 3, datetime.date(2020, 1, 2), 78, 2, None, 'MissingVital', datetime.date(2020, 1, 4), 100),
 (101, 2, datetime.date(2020, 1, 1), 90, 2, None, 'MissingVital', datetime.date(2020, 1, 4), 100),
 (101, 4, datetime.date(2020, 1, 2), 95, 2, None, 'MissingVital', datetime.date(2020, 1, 4), 100),
 (100, 1, datetime.date(2020, 1, 1), 75, 3, None, 'MissingVital', datetime.date(2020, 1, 4), 101),
 (100, 3, datetime.date(2020, 1, 2), 78, 3, None, 'MissingVital', datetime.date(2020, 1, 4), 101),
 (101, 2, datetime.date(2020, 1, 1), 90, 3, None, 'MissingVital', datetime.date(2020, 1, 4), 101),
 (101, 4, datetime.date(2020, 1, 2), 95, 3, None, 'MissingVital', datetime.date(2020, 1, 4), 101)]

* Self-Join

In [ ]:
%%sql

SELECT * FROM cooltime0608.Vital v1
JOIN cooltime0608.Vital v2 ON v1.vitalID = v2.vitalID;

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
4 rows affected.

[(100, 1, datetime.date(2020, 1, 1), 75, 100, 1, datetime.date(2020, 1, 1), 75),
 (100, 3, datetime.date(2020, 1, 2), 78, 100, 3, datetime.date(2020, 1, 2), 78),
 (101, 2, datetime.date(2020, 1, 1), 90, 101, 2, datetime.date(2020, 1, 1), 90),
 (101, 4, datetime.date(2020, 1, 2), 95, 101, 4, datetime.date(2020, 1, 2), 95)]

In [ ]:
%%sql
--Assignment 2 : 사용자별로 처음과 마지막 채널 알아내기 
select 
  distinct usc.userid,
  FIRST_VALUE(usc.channel) over(partition by usc.userid order by st.ts rows between unbounded preceding and unbounded following),
  LAST_VALUE(usc.channel) over(partition by usc.userid order by st.ts rows between unbounded preceding and unbounded following)
from 
  raw_data.user_session_channel usc
inner join raw_data.session_timestamp st ON usc.sessionid = st.sessionid

In [ ]:
%%sql 
--Assignment 3 : gross revenue 가 가장 큰 UserID 10개 찾기

select 
  user_session_channel.userid as "userid",
  sum(transaction.amount) as "gross_revenue"
from
  raw_data.user_session_channel  
left join 
  (select * from raw_data.session_transaction where session_transaction.refunded = 'false') as "transaction" on user_session_channel.sessionid = transaction.sessionid
group by 
  userid
having 
  gross_revenue > 0 
order by gross_revenue desc
limit 10

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(989, 743),
 (772, 556),
 (1615, 506),
 (654, 488),
 (1651, 463),
 (973, 438),
 (262, 422),
 (2682, 414),
 (891, 412),
 (1085, 411)]

In [ ]:
%%sql 
--Assignment 4 : 채널별 월 매출액 테이블 만들기
create table cooltime0608.by_channel_monthly_amount as 
select 
  to_char(timestamp.ts,'yyyy-mm') as "year-month",
  channel.channel,
  count(distinct channel.userid) as "unique_users",
  count(distinct(case when transaction.amount > 0 then userid end)) as "paid_users",
  --count(distinct channel.userid) filter(where transaction.amount >= 0) as "paid_users",
  concat(ROUND(paid_users::decimal/NULLIF(unique_users, 0)*100,2),'%') as "conversion_rate",
  sum(transaction.amount) as "gross_revenue",
  sum(case when transaction.refunded = 'false' then transaction.amount end) as "net_revenue" 
  --sum(transaction.amount) filter(where transaction.refuneded = 'false')
from raw_data.user_session_channel channel 
inner join raw_data.session_timestamp timestamp on channel.sessionid = timestamp.sessionid
inner join raw_data.session_transaction transaction on channel.sessionid = transaction.sessionid
group by 
  "year-month",
  channel
order by 
  "year-month" asc

 * postgresql://cooltime0608:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
Done.

[]